docs: db shcema
